tutorial/pilotedDiffusionFlame/ras/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    AXIS
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       2425;
    }
    OUTLET
    {
        type            patch;
        nFaces          25;
        startFace       2425;
    }
    COFLOW
    {
        type            patch;
        nFaces          15;
        startFace       2450;
    }
    PILOT
    {
        type            patch;
        nFaces          5;
        startFace       2465;
    }
    FUEL
    {
        type            patch;
        nFaces          5;
        startFace       2470;
    }
    WALL
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       2475;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1250;
        startFace       2525;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          1250;
        startFace       3775;
    }
)

// ************************************************************************* //
